Tekla Open API Reference for Tekla Structures 2025
PlacingDirectionAttributes Constructor
Overload List
Name | Description
PlacingDirectionAttributes()
 Creates a new placing direction attributes instance. The positive and negative directions are set to false by default.
PlacingDirectionAttributes(Boolean, Boolean)
 Creates a new placing direction attributes instance.
Top
See Also
Reference
PlacingDirectionAttributes Class
Tekla.Structures.Drawing Namespace